'use strict';
const mockData = [
  {
    "category": [
      `Музыка`,
      `Животные`,
      `Журналы`,
      `Разное`
    ],
    "comments": [
      {
        "id": `NEtAI_`,
        "text": `А где блок питания? Вы что?! В магазине дешевле. Продаю в связи с переездом. Отрываю от сердца.`
      }
    ],
    "description": `Кому нужен этот новый телефон, если тут такое... Бонусом отдам все аксессуары. Срочно!!! Две страницы заляпаны свежим кофе.`,
    "picture": `item16.jpg`,
    "id": `mkfSb7`,
    "title": `Продам отличную подборку фильмов на VHS`,
    "type": `sale`,
    "sum": 86497
  },
  {
    "category": [
      `Посуда`
    ],
    "comments": [
      {
        "id": `YxFfEJ`,
        "text": `Продаю в связи с переездом. Отрываю от сердца.`
      }
    ],
    "description": `Если товар не понравится — верну всё до последней копейки. Пользовались бережно и только по большим праздникам. Мой дед не мог её сломать. Даю недельную гарантию.`,
    "picture": `item05.jpg`,
    "id": `2NILCn`,
    "title": `Куплю все альбомы Агаты Кристи`,
    "type": `offer`,
    "sum": 89681
  },
  {
    "category": [
      `Посуда`,
      `Разное`,
      `Игры`,
      `Животные`,
      `Инструменты`
    ],
    "comments": [
      {
        "id": `z_iKKf`,
        "text": `А где блок питания? Почему в таком ужасном состоянии?`
      }
    ],
    "description": `Пользовались бережно и только по большим праздникам. При покупке с меня бесплатная доставка в черте города. Если найдёте дешевле — сброшу цену. Такая только у меня и у Майкла Джексона.`,
    "picture": `item03.jpg`,
    "id": `n97RY0`,
    "title": `Куплю антиквариат`,
    "type": `offer`,
    "sum": 21745
  },
  {
    "category": [
      `Посуда`,
      `Игры`,
      `Инструменты`,
      `Разное`
    ],
    "comments": [
      {
        "id": `6Wh02W`,
        "text": `А сколько игр в комплекте? Продаю в связи с переездом. Отрываю от сердца. Неплохо, но дорого.`
      },
      {
        "id": `4-QKhP`,
        "text": `А где блок питания?`
      },
      {
        "id": `10pUz1`,
        "text": `Оплата наличными или перевод на карту? Неплохо, но дорого. Продаю в связи с переездом. Отрываю от сердца.`
      }
    ],
    "description": `При покупке с меня бесплатная доставка в черте города. Мой дед не мог её сломать. Это настоящая находка для коллекционера! Кому нужен этот новый телефон, если тут такое...`,
    "picture": `item12.jpg`,
    "id": `DhUFB9`,
    "title": `Отдам сборник песен русского шансона`,
    "type": `offer`,
    "sum": 4139
  },
  {
    "category": [
      `Журналы`,
      `Инструменты`,
      `Посуда`,
      `Книги`,
      `Разное`
    ],
    "comments": [
      {
        "id": `relK8Q`,
        "text": `Неплохо, но дорого.`
      },
      {
        "id": `04amBX`,
        "text": `Почему в таком ужасном состоянии?`
      },
      {
        "id": `7urjxo`,
        "text": `Оплата наличными или перевод на карту?`
      },
      {
        "id": `66VXny`,
        "text": `Неплохо, но дорого. Оплата наличными или перевод на карту?`
      }
    ],
    "description": `Кажется, что это хрупкая вещь. Это настоящая находка для коллекционера! Отправляю исключительно Почтой России. Продаю с болью в сердце...`,
    "picture": `item11.jpg`,
    "id": `jluEIM`,
    "title": `Отдам сборник песен русского шансона`,
    "type": `offer`,
    "sum": 69805
  }
];

module.exports = {mockData};
